src/mysql.org
#+title: mysql
- http://www.mysql.com/
- [[http://book.douban.com/subject/5373022/][MySQL技术内幕]]
- [[http://www.mysqlperformanceblog.com/2014/01/22/past-present-future-mysql-variants-linux-conf-au-2014-talk-video/][Past, present and future of MySQL and variants: linux.conf.au 2014]]
- [[http://dev.mysql.com/doc/refman/5.6/en/index.html][MySQL :: MySQL 5.6 Reference Manual]]

** Cheatsheet
- alter table `userinfo` drop index `email`; -- 删除索引
- alter table `userinfo` add column `email` text not null; -- 添加列
- ALTER TABLE `userinfo` ADD INDEX `index_key` (`field1`, `field2`) -- 增加索引
- show indexes in `userinfo`; -- 显示表索引
- alter table `userinfo` change `email` `email_ext` text; -- 修改列定义
- show variables like 'max_%'; -- 显示变量
- set global max_allowed_packet = 2 * 1024 * 1024; -- 设置变量

** 数据类型
#todo:

** Index索引
*** 索引类型
- 唯一索引 PRIMARY KEY & UNIQUE
  - PRIMARY KEY必须是NOT NULL属性，而UNIQUE不需要
  - 每个数据表只能有一个PRIMARY KEY
- 普通（非唯一）索引 INDEX
- FULLTEXT索引（只适用于MyISAM引擎）
- SPATIAL索引（必须NOT NULL属性）

*** 索引特性
| 索引特性                     | MyISAM | InnoDB    |
|------------------------------+--------+-----------|
| 是否允许使用NULL             | Y      | Y         |
| 每个索引最多支持多少数据列   | 16     | 16        |
| 每个数据表最多多少个索引     | 64     | 64        |
| 索引项的最大长度（字节）     | 1000   | 1024/3072 |
| 能否为数据列前缀创建索引     | Y      | Y         |
| 数据列前缀的最大长度（字节） | 1000   | 767       |
| 是否支持BLOB/TEXT索引        | Y      | Y         |
| 是否支持FULLTEXT索引         | Y      | N         |
| 是否支持SPATIAL索引          | Y      | N         |
| 索引和数据是否分离           | N      | Y         |

索引加快了检索速度，但是却降低了在带索引的数据列里插入删除以及修改的速度，因为不仅需要维护数据还需要维护索引。另外索引要占据磁盘空间。所以如果不需要某个特定的索引来加快查询速度，就不要创建它。

*** 挑选索引
- 尽量为用来搜索，分类或分组的数据列编制索引，不要为作为输出显示的数据列编制索引。
- 综合考虑各数据列的维度势。尽可能选择数值差异比较大也就是维度比较高的数据列来做索引。
- 对短小的值进行索引。
- 为字符串值的前缀编索引。（使用字符串最左边的n个字符来做索引）
  - 如果数据列在前缀长度范围内具有足够的独一无二性，查询性能通常不会受到影响，而是会得到改善。
  - 为数据列前缀而不是整个数据列编索引可以让索引本身更小并加快访问速度。
- 充分利用最左边的前缀。MySQL不能使用没有包含最左边前缀的搜索的索引。
- 适可而止，不要建立过多的索引。
- 让索引的类型与你打算进行的比较操作的类型保持匹配。
  - InnoDB总是使用BTree索引
  - MyISAM也使用BTree索引，但是遇到空间数据类型会改用RTree索引
  - MEMORY默认使用Hash索引，但是也支持BTree索引
- 利用“慢查询”日志找出性能低劣的查询。

** 存储引擎
| 存储引擎                                                   | 存储文件                                    |
|------------------------------------------------------------+---------------------------------------------|
| ARCHIVE 用于数据存档的引擎（数据行被插入之后就不能再修改） | .ARZ 数据文件, .ARM 元数据文件              |
| BLACKHOLE 写操作是删除数据，读操作是返回空白记录           | 不存储任何数据                              |
| CSV 存储数据时候以逗号为数据项之间的分隔符                 | .CSV 数据文件,  .CSM 元数据文件             |
| EXAMPLE 示例（存根）存储引擎                               | 不存储任何数据                              |
| Falcon 用来事务处理的存储引擎                              | 类似InnoDB                                  |
| FEDERATED 用来访问远程数据表的存储引擎                     | 不存储任何数据                              |
| InnoDB 具备外键支持功能的事务处理引擎                      |                                             |
| MEMORY 内存里的数据表                                      | 数据存放在内存，不占用任何磁盘空间          |
| MERGE 用来管理多个MyISAM数据表构成的数据表集合             | .MRG 由各个成员MyISAM数据表的名字构成的清单 |
| MyISAM 默认的存储引擎(indexed sequential access method)    | .MYD 数据文件, .MYI 索引文件                |
| NDB MySQL Cluster的专用存储引擎                            |                                             |

#note: better just to focus on MyISAM and InnoDB

CREATE TABLE table(...) ENGINE = InnoDB/MyISAM optionA = ... optionB = ...; # 创建表格时指定存储引擎

SHOW TABLE STATUS; # 可以查看表格元信息包括使用的存储引擎

*** MyISAM
- MySQL默认使用的存储引擎
- 通过FULLTEXT索引支持全文检索
- 支持空间数据类型和SPATIAL索引
- 数据组织
  - 每个数据表对应一个数据文件和索引文件
  - 数据文件.MYD和索引文件.MYI分开存放
- 并发控制
  - 使用了数据表级别的锁定机制来保证不同的客户不能同时修改同一数据表
  - 在更新量比较大的系统上会导致并发性能的下降

*** InnoDB
- 最早是由Innobase Oy公司开发，后来被Oracle收购
- 支持事务（提交和回滚）操作，还可以通过创建保存点（savepoint）来实现部分回滚（partial rollback）
- 系统崩溃之后可以自动恢复（相比MyISAM更透明）
- 外键和引用完整性支持，包括递归删除和更新
- 数据行级别的锁定和多版本共存，同时进行检索和更新操作的复杂查询里面有非常更好的并发性能（相比MyISAM的数据表级别锁定）
- 数据组织
  - 默认情况下InnoDB会把所有数据表存储在一个共享表空间里面，而不是像MyISAM引擎每个数据表创建单独文件
  - 表空间用类似一个虚拟文件系统方式来管理所有InnoDB数据表内容，可以由多个文件构成还可以包括原始分区，数据表的大小可以不受系统对文件最大长度的限制 #note: InnoDB支持原始分区.
  - 允许每个数据表对应一个.ibd数据文件，但是使用这种方式数据表大小会受到文件最大长度的限制
  - #note: 即使分开存放，共享表空间还是会存放一些共享数据。因为最好不要通过操作文件系统方式来操作InnoDB数据表
  - 但是无论使用上面两种方式的哪一种，InnoDB都是将数据和索引内容一起组织和存放的
- 并发控制
  - 使用了数据行级别的锁定机制，为客户对数据表的访问提供了更加细致的控制
  - 在某个客户修改某个数据行的同时，另外一个客户可以都去和修改同一数据表里面的另外一数据行
  - 如果有两个客户想同时修改某个数据行，先锁定该数据行的客户可以先修改它
  - 比数据表级别的锁定机制提供了更好的并发性能
  - 至于一个客户的事务在何时才能看到另外一个客户的事务做出的修改，属于事务隔离性方面的问题

** 事务处理
*** ACID
事务机制的特性通常被概括为ACID，Atomic，Consistent，Isolated，Durable，他们分别代表事务机制应该具备的一个属性。
- Atomic 构成一个事务的所有语句应该是一个独立的逻辑单元，要么全部执行成功，要么一个都不成功，不能只执行他们当中的一部分。
- Consistent 数据库在事务开始执行之前和事务执行完毕之后都必须是稳定的。
- Isolated 事务不应该相互影响。
- Durable 如果事务执行成功，它的影响将被永久性地记录到数据库里。

