html/mysql.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>mysql</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="dirtysalt" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content">
<h1 class="title">mysql</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Cheatsheet</a></li>
<li><a href="#sec-2">2. 数据类型</a></li>
<li><a href="#sec-3">3. Index索引</a>
<ul>
<li><a href="#sec-3-1">3.1. 索引类型</a></li>
<li><a href="#sec-3-2">3.2. 索引特性</a></li>
<li><a href="#sec-3-3">3.3. 挑选索引</a></li>
</ul>
</li>
<li><a href="#sec-4">4. 存储引擎</a>
<ul>
<li><a href="#sec-4-1">4.1. MyISAM</a></li>
<li><a href="#sec-4-2">4.2. InnoDB</a></li>
</ul>
</li>
<li><a href="#sec-5">5. 事务处理</a>
<ul>
<li><a href="#sec-5-1">5.1. ACID</a></li>
<li><a href="#sec-5-2">5.2. 隔离性</a></li>
</ul>
</li>
<li><a href="#sec-6">6. 外键和引用完整性</a></li>
<li><a href="#sec-7">7. 存储过程</a></li>
<li><a href="#sec-8">8. 元数据</a>
<ul>
<li><a href="#sec-8-1">8.1. SHOW</a></li>
<li><a href="#sec-8-2">8.2. information_schema</a></li>
<li><a href="#sec-8-3">8.3. mysql</a></li>
</ul>
</li>
<li><a href="#sec-9">9. 数据目录</a>
<ul>
<li><a href="#sec-9-1">9.1. 目录位置</a></li>
<li><a href="#sec-9-2">9.2. 层次结构</a></li>
</ul>
</li>
<li><a href="#sec-10">10. 权限管理</a></li>
<li><a href="#sec-11">11. 查询优化</a>
<ul>
<li><a href="#sec-11-1">11.1. 层级估算</a></li>
<li><a href="#sec-11-2">11.2. 优化索引</a></li>
<li><a href="#sec-11-3">11.3. EXPLAIN</a></li>
<li><a href="#sec-11-4">11.4. 查询缓存</a></li>
</ul>
</li>
<li><a href="#sec-12">12. 备份复制</a>
<ul>
<li><a href="#sec-12-1">12.1. 检查修复</a></li>
<li><a href="#sec-12-2">12.2. 数据备份</a></li>
<li><a href="#sec-12-3">12.3. 主从同步</a></li>
</ul>
</li>
<li><a href="#sec-13">13. 配置文件</a></li>
<li><a href="#sec-14">14. 系统变量</a>
<ul>
<li><a href="#sec-14-1">14.1. 日志相关</a></li>
<li><a href="#sec-14-2">14.2. 系统相关</a></li>
<li><a href="#sec-14-3">14.3. 存储引擎</a></li>
</ul>
</li>
<li><a href="#sec-15">15. 编程接口</a>
<ul>
<li><a href="#sec-15-1">15.1. 超时重连</a></li>
<li><a href="#sec-15-2">15.2. 连接数量</a></li>
</ul>
</li>
<li><a href="#sec-16">16. 实用程序</a></li>
<li><a href="#sec-17">17. 其他信息</a>
<ul>
<li><a href="#sec-17-1">17.1. 安装环境</a></li>
<li><a href="#sec-17-2">17.2. 版本选择</a></li>
<li><a href="#sec-17-3">17.3. 测试套件</a></li>
<li><a href="#sec-17-4">17.4. MySQL技术内幕</a></li>
</ul>
</li>
</ul>
</div>
</div>
<ul class="org-ul">
<li><a href="http://www.mysql.com/">http://www.mysql.com/</a>
</li>
<li><a href="http://book.douban.com/subject/5373022/">MySQL技术内幕</a>
</li>
<li><a href="http://www.mysqlperformanceblog.com/2014/01/22/past-present-future-mysql-variants-linux-conf-au-2014-talk-video/">Past, present and future of MySQL and variants: linux.conf.au 2014</a>
</li>
<li id="[[<a href="http://dev.mysql.com/doc/refman/5.6/en/index.html][MySQL">http://dev.mysql.com/doc/refman/5.6/en/index.html][MySQL</a>">MySQL 5.6 Reference Manual]]
</li>
</ul>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Cheatsheet</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>alter table `userinfo` drop index `email`; &#x2013; 删除索引
</li>
<li>alter table `userinfo` add column `email` text not null; &#x2013; 添加列
</li>
<li>ALTER TABLE `userinfo` ADD INDEX `index_key` (`field1`, `field2`) &#x2013; 增加索引
</li>
<li>show indexes in `userinfo`; &#x2013; 显示表索引
</li>
<li>alter table `userinfo` change `email` `email_ext` text; &#x2013; 修改列定义
</li>
<li>show variables like 'max_%'; &#x2013; 显示变量
</li>
<li>set global max_allowed_packet = 2 * 1024 * 1024; &#x2013; 设置变量
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 数据类型</h2>
<div class="outline-text-2" id="text-2">
<p>
#todo:
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Index索引</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 索引类型</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>唯一索引 PRIMARY KEY &amp; UNIQUE
<ul class="org-ul">
<li>PRIMARY KEY必须是NOT NULL属性，而UNIQUE不需要
</li>
<li>每个数据表只能有一个PRIMARY KEY
</li>
</ul>
</li>
<li>普通（非唯一）索引 INDEX
</li>
<li>FULLTEXT索引（只适用于MyISAM引擎）
</li>
<li>SPATIAL索引（必须NOT NULL属性）
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 索引特性</h3>
<div class="outline-text-3" id="text-3-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">索引特性</th>
<th scope="col" class="left">MyISAM</th>
<th scope="col" class="left">InnoDB</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">是否允许使用NULL</td>
<td class="left">Y</td>
<td class="left">Y</td>
</tr>

<tr>
<td class="left">每个索引最多支持多少数据列</td>
<td class="left">16</td>
<td class="left">16</td>
</tr>

<tr>
<td class="left">每个数据表最多多少个索引</td>
<td class="left">64</td>
<td class="left">64</td>
</tr>

<tr>
<td class="left">索引项的最大长度（字节）</td>
<td class="left">1000</td>
<td class="left">1024/3072</td>
</tr>

<tr>
<td class="left">能否为数据列前缀创建索引</td>
<td class="left">Y</td>
<td class="left">Y</td>
</tr>

<tr>
<td class="left">数据列前缀的最大长度（字节）</td>
<td class="left">1000</td>
<td class="left">767</td>
</tr>

<tr>
<td class="left">是否支持BLOB/TEXT索引</td>
<td class="left">Y</td>
<td class="left">Y</td>
</tr>

<tr>
<td class="left">是否支持FULLTEXT索引</td>
<td class="left">Y</td>
<td class="left">N</td>
</tr>

<tr>
<td class="left">是否支持SPATIAL索引</td>
<td class="left">Y</td>
<td class="left">N</td>
</tr>

<tr>
<td class="left">索引和数据是否分离</td>
<td class="left">N</td>
<td class="left">Y</td>
</tr>
</tbody>
</table>

<p>
索引加快了检索速度，但是却降低了在带索引的数据列里插入删除以及修改的速度，因为不仅需要维护数据还需要维护索引。另外索引要占据磁盘空间。所以如果不需要某个特定的索引来加快查询速度，就不要创建它。
</p>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> 挑选索引</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>尽量为用来搜索，分类或分组的数据列编制索引，不要为作为输出显示的数据列编制索引。
</li>
<li>综合考虑各数据列的维度势。尽可能选择数值差异比较大也就是维度比较高的数据列来做索引。
</li>
<li>对短小的值进行索引。
</li>
<li>为字符串值的前缀编索引。（使用字符串最左边的n个字符来做索引）
<ul class="org-ul">
<li>如果数据列在前缀长度范围内具有足够的独一无二性，查询性能通常不会受到影响，而是会得到改善。
</li>
<li>为数据列前缀而不是整个数据列编索引可以让索引本身更小并加快访问速度。
</li>
</ul>
</li>
<li>充分利用最左边的前缀。MySQL不能使用没有包含最左边前缀的搜索的索引。
</li>
<li>适可而止，不要建立过多的索引。
</li>
<li>让索引的类型与你打算进行的比较操作的类型保持匹配。
<ul class="org-ul">
<li>InnoDB总是使用BTree索引
</li>
<li>MyISAM也使用BTree索引，但是遇到空间数据类型会改用RTree索引
</li>
<li>MEMORY默认使用Hash索引，但是也支持BTree索引
</li>
</ul>
</li>
<li>利用“慢查询”日志找出性能低劣的查询。
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 存储引擎</h2>
<div class="outline-text-2" id="text-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">存储引擎</th>
<th scope="col" class="left">存储文件</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">ARCHIVE 用于数据存档的引擎（数据行被插入之后就不能再修改）</td>
<td class="left">.ARZ 数据文件, .ARM 元数据文件</td>
</tr>

<tr>
<td class="left">BLACKHOLE 写操作是删除数据，读操作是返回空白记录</td>
<td class="left">不存储任何数据</td>
</tr>

<tr>
<td class="left">CSV 存储数据时候以逗号为数据项之间的分隔符</td>
<td class="left">.CSV 数据文件,  .CSM 元数据文件</td>
</tr>

<tr>
<td class="left">EXAMPLE 示例（存根）存储引擎</td>
<td class="left">不存储任何数据</td>
</tr>

<tr>
<td class="left">Falcon 用来事务处理的存储引擎</td>
<td class="left">类似InnoDB</td>
</tr>

<tr>
<td class="left">FEDERATED 用来访问远程数据表的存储引擎</td>
<td class="left">不存储任何数据</td>
</tr>

<tr>
<td class="left">InnoDB 具备外键支持功能的事务处理引擎</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">MEMORY 内存里的数据表</td>
<td class="left">数据存放在内存，不占用任何磁盘空间</td>
</tr>

<tr>
<td class="left">MERGE 用来管理多个MyISAM数据表构成的数据表集合</td>
<td class="left">.MRG 由各个成员MyISAM数据表的名字构成的清单</td>
</tr>

<tr>
<td class="left">MyISAM 默认的存储引擎(indexed sequential access method)</td>
<td class="left">.MYD 数据文件, .MYI 索引文件</td>
</tr>

<tr>
<td class="left">NDB MySQL Cluster的专用存储引擎</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
#note: better just to focus on MyISAM and InnoDB
</p>

<p>
CREATE TABLE table(&#x2026;) ENGINE = InnoDB/MyISAM optionA = &#x2026; optionB = &#x2026;; # 创建表格时指定存储引擎
</p>

<p>
SHOW TABLE STATUS; # 可以查看表格元信息包括使用的存储引擎
</p>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> MyISAM</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>MySQL默认使用的存储引擎
</li>
<li>通过FULLTEXT索引支持全文检索
</li>
<li>支持空间数据类型和SPATIAL索引
</li>
<li>数据组织
<ul class="org-ul">
<li>每个数据表对应一个数据文件和索引文件
</li>
<li>数据文件.MYD和索引文件.MYI分开存放
</li>
</ul>
</li>
<li>并发控制
<ul class="org-ul">
<li>使用了数据表级别的锁定机制来保证不同的客户不能同时修改同一数据表
</li>
<li>在更新量比较大的系统上会导致并发性能的下降
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> InnoDB</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>最早是由Innobase Oy公司开发，后来被Oracle收购
</li>
<li>支持事务（提交和回滚）操作，还可以通过创建保存点（savepoint）来实现部分回滚（partial rollback）
</li>
<li>系统崩溃之后可以自动恢复（相比MyISAM更透明）
</li>
<li>外键和引用完整性支持，包括递归删除和更新
</li>
<li>数据行级别的锁定和多版本共存，同时进行检索和更新操作的复杂查询里面有非常更好的并发性能（相比MyISAM的数据表级别锁定）
</li>
<li>数据组织
<ul class="org-ul">
<li>默认情况下InnoDB会把所有数据表存储在一个共享表空间里面，而不是像MyISAM引擎每个数据表创建单独文件
</li>
<li>表空间用类似一个虚拟文件系统方式来管理所有InnoDB数据表内容，可以由多个文件构成还可以包括原始分区，数据表的大小可以不受系统对文件最大长度的限制 #note: InnoDB支持原始分区.
</li>
<li>允许每个数据表对应一个.ibd数据文件，但是使用这种方式数据表大小会受到文件最大长度的限制
</li>
<li>#note: 即使分开存放，共享表空间还是会存放一些共享数据。因为最好不要通过操作文件系统方式来操作InnoDB数据表
</li>
<li>但是无论使用上面两种方式的哪一种，InnoDB都是将数据和索引内容一起组织和存放的
</li>
</ul>
</li>
<li>并发控制
<ul class="org-ul">
<li>使用了数据行级别的锁定机制，为客户对数据表的访问提供了更加细致的控制
</li>
<li>在某个客户修改某个数据行的同时，另外一个客户可以都去和修改同一数据表里面的另外一数据行
</li>
<li>如果有两个客户想同时修改某个数据行，先锁定该数据行的客户可以先修改它
</li>
<li>比数据表级别的锁定机制提供了更好的并发性能
</li>
<li>至于一个客户的事务在何时才能看到另外一个客户的事务做出的修改，属于事务隔离性方面的问题
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 事务处理</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> ACID</h3>
<div class="outline-text-3" id="text-5-1">
<p>
事务机制的特性通常被概括为ACID，Atomic，Consistent，Isolated，Durable，他们分别代表事务机制应该具备的一个属性。
</p>
<ul class="org-ul">
<li>Atomic 构成一个事务的所有语句应该是一个独立的逻辑单元，要么全部执行成功，要么一个都不成功，不能只执行他们当中的一部分。
</li>
<li>Consistent 数据库在事务开始执行之前和事务执行完毕之后都必须是稳定的。
</li>
<li>Isolated 事务不应该相互影响。
</li>
<li>Durable 如果事务执行成功，它的影响将被永久性地记录到数据库里。
</li>
</ul>
</div>
</div>
