src/mysql.org
*** 隔离性
- http://en.wikipedia.org/wiki/Isolation_(database_systems)
- http://www.ovaistariq.net/597/understanding-innodb-transaction-isolation-levels/

InnoDB存储引擎实现的事务隔离级别机制能够让客户控制他们想看到其他事务做的修改。它提供了多种不同的隔离级别以允许或预防在多个事务同时运行时可能发生的各种各样的问题：
- 脏读（dirty read） 某个事务所作的修改在它尚未被提交时就可以被其他事务看到。
- 不可重复读取（nonrepeatable read） 同一个事务使用同一条select语句每次读取到的结果不一样。
- 幻影数据行（phantom row） 某个事务突然看到一个它以前没有见过的数据行。

为了解决这些问题，InnoDB存储引擎提供了4种隔离级别。这些隔离级别用来确定允许某个事务看到与之同时执行的其他事务所做出的修改：（级别不断提高）
- READ UNCOMMITED 允许事务看到其他事务尚未提交的数据行改动
- READ COMMITED 只允许事务看到其他事务已经提交的数据行改动
  - a lock-based concurrency control DBMS implementation keeps write locks (acquired on selected data) until the end of the transaction, but read locks are released as soon as the SELECT operation is performed (so the non-repeatable reads phenomenon can occur in this isolation level, as discussed below). As in the previous level, range-locks are not managed.
  - Putting it in simpler words, read committed is an isolation level that guarantees that any data read is committed at the moment it is read. It simply restricts the reader from seeing any intermediate, uncommitted, 'dirty' read. It makes no promise whatsoever that if the transaction re-issues the read, it will find the same data; data is free to change after it is read.
- REPEATABLE READ 如果某个事务两次执行同一个select语句，其结果是可重复的。也就是说如果两次期间如果有数据修改的话，修改是隔离的。InnoDB默认的事务隔离级别。
  - a lock-based concurrency control DBMS implementation keeps read and write locks (acquired on selected data) until the end of the transaction. However, range-locks are not managed, so the phantom reads phenomenon can occur (see below).
  - As the text above describes, phantom reads is the only problem that SERIALIZABLE is helping you avoid, otherwise SERIALIZABLE is pretty much same as REPEATABLE-READ. InnoDB has a special locking feature called gap-locking which helps you avoid the phantom reads problem. In the case of gap locking, a lock is set on the gap between index records, or on the gap before the first or after the last index record. Now all you have to do avoid phantom reads is to convert such reads to locking reads using SELECT with FOR UPDATE or LOCK IN SHARE MODE.（可以通过gap-locking来避免phantom read，这样避免使用SERIALIZABLE隔离性）
- SERIALIZABLE 这个隔离级别与REPEATABLE READ很相似，但对事务的隔离更加彻底，某个事务正在查看的数据行不允许其他事务修改，直到该事务完成为止。
  - With a lock-based concurrency control DBMS implementation, serializability requires read and write locks (acquired on selected data) to be released at the end of the transaction. Also range-locks must be acquired when a SELECT query uses a ranged WHERE clause, especially to avoid the *phantom reads* phenomenon (see below). #note: 所以不仅仅只有read/write lock, 还有range-lock.
  - When using non-lock based concurrency control, no locks are acquired; however, if the system detects a write collision among several concurrent transactions, only one of them is allowed to commit. See *snapshot isolation* for more details on this topic.

*Isolation Levels vs Read Phenomena*
| Isolation level  | Dirty reads | Non-repeatable reads      | Phantoms  |
|------------------+-------------+---------------------------+-----------|
| Read Uncommitted | may occur   | may occur                 | may occur |
| Read Committed   | -           | may occur       may occur |           |
| Repeatable Read  | -           | -                         | may occur |
| Serializable   - | -           | -                         |           |

| 隔离级别        | 脏读 | 不可重复读取 | 幻影数据行 |
|-----------------+------+--------------+------------|
| READ UNCOMMITED | Y    | Y            | Y          |
| READ COMMITED   | N    | Y            | Y          |
| REPEATABLE READ | N    | N            | Y          |
| SERIALIZABLE    | N    | N            | N          |

*Isolation Levels vs Lock Duration*
In lock-based concurrency control, isolation level determines the duration that locks are held.
- "C" - Denotes that locks are held until the transaction commits.
- "S" - Denotes that the locks are held only during the currently executing statement. Note that if locks are released after a statement, the underlying data could be changed by another transaction before the current transaction commits, thus creating a violation.
| Isolation level  | Write Operation | Read Operation | Range Operation (...where...) |
|------------------+-----------------+----------------+-------------------------------|
| Read Uncommitted | S               | S              | S                             |
| Read Committed   | C               | S              | S                             |
| Repeatable Read  | C               | C              | S                             |
| Serializable     | C               | C              | C                             |

不同隔离级别使用的锁：
- The READ-UNCOMMITTED isolation level has the least number of locking done,
- after that comes the READ-COMMITTED isolation level which removes most of the gap-locking and hence produces fewer deadlocks, also in the case of READ-COMMITTED, locking reads only lock the index records and not the gaps before/after them.
- REPEATABLE-READ has a higher level of locking as compared to READ-COMMITTED, UPDATE, DELETE use next-key locking, also locking reads also use next-key locking.
- SERIALIZABLE has the highest level of locking, all the simple SELECTs are automatically converted to SELECT ... LOCK IN SHARE MODE, and hence all records have shared locks.

As I have mentioned in the "Locking and the isolation levels" section, SERIALIZABLE and REPEATABLE-READ employ lots of locking and hence creating more deadlock situations, which in turn decreases performance. In fact SERIALIZABLE is the least performant of the isolation levels, as it converts even plain reads into locking reads. REPEATABLE-READ is better in terms of locking and deadlocks but READ-COMMITTED is even better because there are fewer gap-locks. But locking and deadlocks is not the only thing when considering performance, there is another issue of mutex contention that needs consideration. There is a post by Mark Callaghan comparing both REPEATABLE-READ and READ-COMMITTED in the context of mutex contention. This post can be found [[http://www.facebook.com/note.php?note_id%3D244956410932][here]]. （随着隔离级别升高使用锁更加激进，那么死锁和带来的性能下降更加明显）

The default replication type in MySQL is statement-based replication, and this replication type replicates the data changes by re-executing SQL statements on slaves that were executed on the master. This requires the isolation level to be stricter (involving more locking) so that the data changes are consistent in such a way that the same SQL when executed on the slave produces the same data changes. As mentioned above, READ-COMMITTED creates a situation of non-repeatable read, hence its not safe for statement-based replication. Hence, when using statement-based replication either use SERIALIZABLE or REPEATABLE-READ isolation level. If you have MySQL version >= 5.1 then you can use READ-COMMITTED with the row-based replication, because with row-based replication you have exact information about each data row changes.（不同事务级别对于备份模型的要求） #note：可以看出ROW相对STMT来说受到事务隔离性影响更小也会更加安全

