src/mysql.org
** 外键和引用完整性
** 存储过程
** 元数据
*** SHOW
#todo:
- SHOW DATABASES;
- SHOW CREATE DATABASE db_name;
- SHOW TABLES [FROM db_name];
- SHOW CREATE TABLE tbl_name;
- SHOW COLUMNS FROM tbl_name;
- SHOW INDEX FROM tbl_name;
- SHOW TABLE STATUS [FROM db_name];

*** information_schema
可以将information_schema看作一个虚拟数据库，里面的数据表是不同数据库的元数据所构成的视图。各个存储引擎还会在这里面添加它们专用的数据表。

#+BEGIN_EXAMPLE
mysql> show tables in information_schema;
+---------------------------------------+
| Tables_in_information_schema          |
+---------------------------------------+
| CHARACTER_SETS                        |
| COLLATIONS                            |
| COLLATION_CHARACTER_SET_APPLICABILITY |
| COLUMNS                               |
| COLUMN_PRIVILEGES                     |
| ENGINES                               |
| EVENTS                                |
| FILES                                 |
| GLOBAL_STATUS                         |
| GLOBAL_VARIABLES                      |
| KEY_COLUMN_USAGE                      |
| PARAMETERS                            |
| PARTITIONS                            |
| PLUGINS                               |
| PROCESSLIST                           |
| PROFILING                             |
| REFERENTIAL_CONSTRAINTS               |
| ROUTINES                              |
| SCHEMATA                              |
| SCHEMA_PRIVILEGES                     |
| SESSION_STATUS                        |
| SESSION_VARIABLES                     |
| STATISTICS                            |
| TABLES                                |
| TABLESPACES                           |
| TABLE_CONSTRAINTS                     |
| TABLE_PRIVILEGES                      |
| TRIGGERS                              |
| USER_PRIVILEGES                       |
| VIEWS                                 |
| INNODB_BUFFER_PAGE                    |
| INNODB_TRX                            |
| INNODB_BUFFER_POOL_STATS              |
| INNODB_LOCK_WAITS                     |
| INNODB_CMPMEM                         |
| INNODB_CMP                            |
| INNODB_LOCKS                          |
| INNODB_CMPMEM_RESET                   |
| INNODB_CMP_RESET                      |
| INNODB_BUFFER_PAGE_LRU                |
+---------------------------------------+
#+END_EXAMPLE

*** mysql
#todo:

#+BEGIN_EXAMPLE
mysql> show tables in mysql;
+---------------------------+
| Tables_in_mysql           |
+---------------------------+
| columns_priv              |
| db                        |
| event                     |
| func                      |
| general_log               |
| help_category             |
| help_keyword              |
| help_relation             |
| help_topic                |
| host                      |
| ndb_binlog_index          |
| plugin                    |
| proc                      |
| procs_priv                |
| proxies_priv              |
| servers                   |
| slow_log                  |
| tables_priv               |
| time_zone                 |
| time_zone_leap_second     |
| time_zone_name            |
| time_zone_transition      |
| time_zone_transition_type |
| user                      |
+---------------------------+
#+END_EXAMPLE

** 数据目录
*** 目录位置
- 源代码安装默认是 /usr/local/mysql/var
- 包安装默认是 /var/lib/mysql
- configure选项 --localstatedir 可以修改默认位置
- datadir 选项可以指定位置

*** 层次结构
- 每个数据库对应一个目录
  - .opt文件列出这个数据库默认使用的字符集和排序方式
  - 数据库内的数据表，视图和触发器对应于该数据库目录中的文件
  - 每个视图对应一个.frm文件，数据表也对应一个.frm文件
  - 和某个数据表tbl相关的触发器定义和相关信息，存储在tbl.trg文件里面
  - 同一个数据表可以有多个触发器，而服务器把他们的定义集中保存在同一个.trg文件里面
- 服务器进程ID文件。
  - HOSTNAME.pid
- 服务器生成状态和日志文件。
  - HOSTNAME.err 错误日志
  - HOSTNAME.log 一般查询日志
  - HOSTNAME-bin.nnnnnn 二进制文件（修改数据语句和内容）
  - HOSTNAME-bin.index 二进制文件的索引文件
  - HOSTNAME-relay-bin.nnnnnn  延迟日志
  - HOSTNAME-relay-bin.index 延迟日志索引
  - master.info 主服务器信息
  - relay-log.info 延迟信息
  - HOSTNAME-slow.log 慢查询日志
    - 判断是否为慢查询和下面两个指标相关
    - long_query_time（单位秒） # 判断多长时间为慢
    - min_examined_row_limit # 只有被查询这么多次之后才有资格被记录到日志里面

** 权限管理
- GRANT ALL PRIVILEGES ON <db>(*).<table>(*) TO 'user'@'host' IDENTIFIED BY 'password' # 授权
- SET PASSWORD for 'user'@'host' = password('123456') # 重置密码
- FLUSH PRIVILEGES # 刷新权限表

** 查询优化
*** 层级估算
#note: credited to caole

以innodb为例，每个page(注意这里是innodb的page,不是linux page)是16K. B+Tree的话那么每层都会存放key. 假设key为16个字节的话，包括overhead 16个字节，那么一个page里面就能够存放512个节点。如果记录界级别在billion级别的话，那么深度在3-4层左右。估算出层级数目是非常有好处的，可以对query做envelope calculation. 假设不考虑page cache的话，那么查询一条记录通常需要读取3-4次。假设存在cache命中50%的话，那么读取次数在1.5-2次。如果使用MySQL没有缓存层并且都是简单查询的话，要求查询性能在2w/s. 那么要求disk IOPS必须在3w-4w/s上。所以如果性能达不到这个要求的话，那么就需要考虑分表。 #note: 所以分表可能会是因为性能原因，也可能会是因为存储空间原因

*** 优化索引
- 对数据表进行分析
  - 生成关于索引值分布情况的统计数据，帮助优化器对索引的使用效果做出更准确的评估
  - 默认情况下当把有索引数据列与常数比较的时候，优化起会假设相关索引里的键值是均匀分布的，同时还会对索引进行一次快速检查以估算需要用到多少个索引项
  - 使用ANALYSE TABLE语句来进行分析，频率根据数据表变化频繁程度而定
- 对容易产生碎片的数据表进行整理，定期使用OPTIMIZE TABLE语句有助于防止数据表查询性能的降低
- 使用EXPLAIN语句验证优化器操作 # 可以告诉查询计划，是否使用索引以及如何使用索引等
- 提示优化器
  - FORCE INDEX, USE INDEX, IGNORE INDEX
  - STRAIGHT_JOIN # 强制优化器按照特定顺序来做JOIN
- 尽量使用数据类型相同的数据列进行比较
- 使带索引的数据列在比较表达式中单独出现
  - f(x) < 4, 这样就需要遍历所有x并且作用f然后比较。所以最好是可以x < f^-1(4)
- 不要在LIKE模式的开始位置使用通配符
- 试验各种查询的变化格式，并且需要多次运行它们
- 避免过多使用MySQL的自动类型转换功能 #note: 隐式类型转换会可能会阻碍索引的使用

