src/mysql.org
*** EXPLAIN
EXPLAIN语句提供的信息可以帮助我们了解优化器为处理各种语句而生成的执行计划。这里以两个例子做说明。假设我们有t1,t2两个数据表，列分别为k(int)，v(int)，然后分别执行下面语句
1. SELECT * from t1 WHERE k < 20 AND k > 10
2. SELECT * from t1 INNER JOIN t2 WHERE t1.k = t2.k
假设t1数据有1000条记录k=[1,50], 而t2数据有10条记录k=[1,10]

#+BEGIN_EXAMPLE
#!/bin/bash
echo "DROP DATABASE test;"
echo "CREATE DATABASE test;"
echo "USE test";
echo "CREATE TABLE t1 (k INT NOT NULL, v INT);"
echo "CREATE TABLE t2 (k INT PRIMARY KEY, v INT);"
echo "use test";
for((i=1;i<=50;i++))
do
    echo "INSERT INTO t1 VALUES($i,$i);"
done
for((i=1;i<=10;i++))
do
    echo "INSERT INTO t2 VALUES($i,$i);"
done
#+END_EXAMPLE

t1开始没有索引，然后我们使用EXAPLAIN来察看效果
#+BEGIN_EXAMPLE
mysql> explain SELECT * from t1 WHERE k < 20 AND k > 10;
+----+-------------+-------+------+---------------+------+---------+------+------+-------------+
| id | select_type | table | type | possible_keys | key  | key_len | ref  | rows | Extra       |
+----+-------------+-------+------+---------------+------+---------+------+------+-------------+
|  1 | SIMPLE      | t1    | ALL  | NULL          | NULL | NULL    | NULL |   50 | Using where |
+----+-------------+-------+------+---------------+------+---------+------+------+-------------+
#+END_EXAMPLE
- select_type 简单选择 #todo: ???
- table 数据表
- type 优化器可以用来搜索的区间（ALL表示只能全部扫描）
- possible_keys 可以用来做搜索的keys
- key/key_len 最终选择用来做搜索的key和其长度
- ref 是否参考其他数据表字段
- row 处理多少行数据
- Extra #todo: ???
可以看到这个检索只能够使用全表扫描，下面来看看加上索引的效果

#+BEGIN_EXAMPLE
mysql> ALTER TABLE t1 ADD INDEX (k);
Query OK, 0 rows affected (0.18 sec)
Records: 0  Duplicates: 0  Warnings: 0

mysql> explain SELECT * from t1 WHERE k < 20 AND k > 10;
+----+-------------+-------+-------+---------------+------+---------+------+------+-------------+
| id | select_type | table | type  | possible_keys | key  | key_len | ref  | rows | Extra       |
+----+-------------+-------+-------+---------------+------+---------+------+------+-------------+
|  1 | SIMPLE      | t1    | range | k             | k    | 4       | NULL |    8 | Using where |
+----+-------------+-------+-------+---------------+------+---------+------+------+-------------+
#+END_EXAMPLE
- type=range 表明可以有范围查询
- possible_keys 可以使用k来做搜索
- key/key_len 最后也是使用k来做搜索，并且长度为4字节
- rows 只需要处理8个数据行

为t1加上索引之后，然后看看语句2的效果
#+BEGIN_EXAMPLE
mysql> explain SELECT * from t1 INNER JOIN t2 WHERE t1.k = t2.k;
+----+-------------+-------+------+---------------+------+---------+-----------+------+-------+
| id | select_type | table | type | possible_keys | key  | key_len | ref       | rows | Extra |
+----+-------------+-------+------+---------------+------+---------+-----------+------+-------+
|  1 | SIMPLE      | t2    | ALL  | PRIMARY       | NULL | NULL    | NULL      |   10 |       |
|  1 | SIMPLE      | t1    | ref  | k             | k    | 4       | test.t2.k |    1 |       |
+----+-------------+-------+------+---------------+------+---------+-----------+------+-------+

#+END_EXAMPLE
可以看到MySQL非常智能，并没有扫描t1然后在t2中查找，而是扫描t2在t1中查找。

*** 查询缓存
如果数据很少更新的话，那么开启查询缓存是有利的。如果数据表被更新的话，所有与之相关的查询缓存都会失效并且被删除。
- configure阶段 --without-query-cache 可以构建不带查询缓存的服务器
- have_query_cache 是否支持查询缓存
- query_cache_type
  - 0 不使用查询缓存
  - 1 开启，但是不包括SELECT SQL_NO_CACHE开头的查询
  - 2 开启，但是只包括SELECT SQL_CACHE开头的查询
- query_cache_size 查询缓存大小，字节为单位
- query_cache_limit 缓存最大结果集合大小，比这个值大的查询结果不能被缓存

** 备份复制
*** 检查修复
- CHECK TABLE
- REPAIR TABLE
- mysqlcheck

*** 数据备份
数据库备份按照它们的格式可以分为两大类
- 文本格式备份，通过使用mysqldump程序把数据表内容输出成为SQL语句
- 二进制备份，直接复制包含数据表内容的文件（不是特别推荐）

有效加载数据基于下面几个基本原则
- 批量加载效率比单行加载的效率高 # 减少刷新频率和IO操作
- 加载有索引的数据表比加载无索引的数据表慢 # 更新索引
- 较短SQL语句比较长SQL语句快 # 更少的语法分析以及更少的传输量

