src/mysql.org
*** 主从同步
mysql实现上是所有操作都会写到binlog里面，然后slave有一个专门的io线程(IO_THREAD)不断地从master binlog里面取出增量数据，写到本地的relay-log.同时slave本地有一个执行线程(SQL_THREAD)，将这些realy-log执行修改自己的数据库，达到同步的目的。relay-log里面的内容和master binlog内容每条记录都是完全相同的，最后进入slave binlog记录和master binlog对应记录也是一样的。执行id是master id,执行时间是master binlog记录的时间，本地slave是不会进行任何修改的。主从同步要求不仅要求主从服务器在二进制日志的格式方面兼容，还要在功能上兼容（执行对应的语句）

| 选项                | 内容                                        |
|---------------------+---------------------------------------------|
| server-id           | 服务器编号                                  |
| relay_log_purge     | 删除无用的relaylog                          |
| log-slave-updates   | binlog里面也会保存relay-log（默认是不保存） |
| max_binlog_size     | 单个binlog文件最大大小                      |
| max_relay_log_size  | 单个relaylog文件最大大小                    |
| expire_logs_days=n  | 自动删除超过n天的binlog，并且更新索引文件   |
| replicate-ignore-db | slave忽略某些数据库的操作                   |
| binlog-ignore-db    | master将某些数据库操作不写入binlog          |
| binlog-format       | binlog日志格式                              |

binlog-format有三种选择
- STATEMENT 基于语句，比较简短但是控制粒度不高
- ROW 基于数据行，比较冗余但是控制粒度好
- MIXED 混合。优先选择基于数据行，确有必要时候使用基于语句

基本命令：
- show binary logs; # 所有binlog
- show master logs; # 所有binlog
- show binlog events; # 察看binlog内容
- show master status; # 当前master进度
- reset master; # 清除所有binlog
- reset slave; # 清除所有relaylog
- start/stop slave # 启动停止复制
  - IO_THREAD 只启动停止IO线程
  - SQL_THREAD 只启动停止SQL线程
- purge master/binary logs to 'log-bin.000012'; # 将log-bin.000012之前的binlog都删除
- change master to master_host='', master_user='', master_password='', master_log_file='', master_log_pos='' # 初始化复制坐标
  - 初始复制状态会记录在master.info文件，并且随着镜像工作进展而刷新这个文件

半同步(semi-sync)
- http://www.db110.com/?p=3364
- http://code.google.com/p/google-mysql-tools/wiki/SemiSyncReplication
- http://code.google.com/p/google-mysql-tools/wiki/SemiSyncReplicationDesign
- http://dev.mysql.com/doc/refman/5.5/en/replication-semisync.html
很早之前做了一个mysql集群主从切换模块，里面就涉及到了半同步。按照半同步的定义（全同步的语义应该就是等待所有的slave都同步完成，强一致性），半同步还是会存在丢数据的可能，半同步的语义仅仅是认为一个slave同步到数据之后的话同步就完成。但是如果master挂掉同时slave也挂掉（或者是没有等其他slave补齐数据的话），那么就会存在数据丢失的可能（仅仅是提供最终一致性可能）。Semisynchronous replication can be used as an alternative to asynchronous replication:
- A slave indicates whether it is semisynchronous-capable when it connects to the master.（slave必须声明自己是semi-sync的）
- If semisynchronous replication is enabled on the master side and there is at least one semisynchronous slave, a thread that performs a transaction commit on the master blocks after the commit is done and waits until at least one semisynchronous slave acknowledges that it has received all events for the transaction, or until a timeout occurs.（master也必须声明自己是semi-sync的，并且至少一个semi-sync slave连接上来，才会开启semi-sync模式。事务必须至少有一个semi-sync slave确认之后才会成功返回）
- The slave acknowledges receipt of a transaction's events only after the events have been written to its relay log and flushed to disk.（slave的确认是relay log完全刷到磁盘上）
- If a timeout occurs without any slave having acknowledged the transaction, the master reverts to asynchronous replication. When at least one semisynchronous slave catches up, the master returns to semisynchronous replication.（如果超时之前没有确认事务的话，那么master会转到async模式，直到有一个semi-sync slave追上为止）
- Semisynchronous replication must be enabled on both the master and slave sides. If semisynchronous replication is disabled on the master, or enabled on the master but on no slaves, the master uses asynchronous replication.（slave和master两端都必须打开semi-sync）

GTID(global trx id)(since MySQL 5.6)
- https://dev.mysql.com/doc/refman/5.6/en/replication-gtids.html
- http://www.mysqlperformanceblog.com/2013/02/08/how-to-createrestore-a-slave-using-gtid-replication-in-mysql-5-6/
需要使用下面参数
- gtid_mode=ON
- log-bin
- log-slave-updates
- enforce-gtid-consistency=true
- server_id
- #note: much eaiser to handle master-slave replication and failover situation

** 配置文件
- ~/.my.cnf overrides /etc/my.cnf
- [client] MySQL客户端程序选项组标记
- [server] MySQL服务端程序选项组标记
- [mysqld] MySQL服务端程序选项组标记
- [mysqld-X.Y] MySQL服务端程序选项组标记，但是只有X.Y这个版本才会读取
- [mysqld<nnnn>] MySQL服务实例<nnnn>选项组标记，启动多实例时候有用
- [mysqld_safe] mysqld_safe程序选项组标记
- [mysqld_multi] mysqld_multi程序选项组标记
- [mysql_install_db] mysql_install_db程序选项组标记

** 系统变量
- http://www.mysqlperformanceblog.com/2014/01/28/10-mysql-settings-to-tune-after-installation/

系统变量按照其作用范围的大小分为两个级别
- 全局级 # 全面影响整个服务器的操作，比如key_buffer_size控制MyISAM的索引数据缓冲区大小
- 会话级 # 只印象服务器如何对待一个给定的客户链接，比如autocommit控制是否自动提交事务
可以通过下面两个命令来察看
- SHOW VARIABLES # 优先会话级别
  - SHOW GLOBAl VARIABLES
  - SHOW SESSION/LOCAL VARIABLES
- mysqladmin variables # 全局级别
在SQL语句变量先使用会话级别，然后再使用全局级别，也可以显式指定
- @@SESSION.var_name
- @@LOCAL.var_name
- @@GLOBAL.var_name

MySQL服务器提供的状态变量使我们可以及时掌握它的实际运行状况。状态变量也分为全局和会话级别，可以通过下面命令察看
- SHOW STATUS
- SHOW GLOBAL STATUS
- SHOW LOCAL/SESSION STATUS

*** 日志相关
刷新日志
- FLUSH LOG & mysqladmin flush-logs
- 出错日志会关闭并且重命名为-old后缀文件，然后重新打开新文件写
- 二进制和中继日志会关闭当前文件，然后打开下一个顺序编号的新文件

| 选项                          | 内容                                                             |
|-------------------------------+------------------------------------------------------------------|
| log-error[=filename]          |                                                                  |
| log[=filename]                  |                                                                  |
| log-slow-queries=[filename]   |                                                                  |
| log-output[=destionation]     | 常规/慢查询日志存放地点，FILE（文件，默认）/TABLE（数据表）/NONE |
| log-bin[=flename]             |                                                                  |
| log-bin-index=filename        |                                                                  |
| log-relay[=filename]          |                                                                  |
| replay-log-index=filename     |                                                                  |
| log-short-format              |                                                                  |
|-------------------------------+------------------------------------------------------------------|
| log-queries-not-using-indexes | 执行时没有使用索引的查询记录到慢查询日志                         |
| log-slow-admin-statements     | 执行较慢的系统管理语句记录到慢查询日志                           |


binlog & relaylog
| 选项          | 内容                                                                         |
|---------------+------------------------------------------------------------------------------|
| sync_binlog=n | 每进行n次事务提交之后使用fsync等磁盘同步指令将binlog_cache中数据强制写入磁盘 |

