html/mysql.html

<div id="outline-container-sec-12-3" class="outline-3">
<h3 id="sec-12-3"><span class="section-number-3">12.3</span> 主从同步</h3>
<div class="outline-text-3" id="text-12-3">
<p>
mysql实现上是所有操作都会写到binlog里面，然后slave有一个专门的io线程(IO_THREAD)不断地从master binlog里面取出增量数据，写到本地的relay-log.同时slave本地有一个执行线程(SQL_THREAD)，将这些realy-log执行修改自己的数据库，达到同步的目的。relay-log里面的内容和master binlog内容每条记录都是完全相同的，最后进入slave binlog记录和master binlog对应记录也是一样的。执行id是master id,执行时间是master binlog记录的时间，本地slave是不会进行任何修改的。主从同步要求不仅要求主从服务器在二进制日志的格式方面兼容，还要在功能上兼容（执行对应的语句）
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">选项</th>
<th scope="col" class="left">内容</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">server-id</td>
<td class="left">服务器编号</td>
</tr>

<tr>
<td class="left">relay_log_purge</td>
<td class="left">删除无用的relaylog</td>
</tr>

<tr>
<td class="left">log-slave-updates</td>
<td class="left">binlog里面也会保存relay-log（默认是不保存）</td>
</tr>

<tr>
<td class="left">max_binlog_size</td>
<td class="left">单个binlog文件最大大小</td>
</tr>

<tr>
<td class="left">max_relay_log_size</td>
<td class="left">单个relaylog文件最大大小</td>
</tr>

<tr>
<td class="left">expire_logs_days=n</td>
<td class="left">自动删除超过n天的binlog，并且更新索引文件</td>
</tr>

<tr>
<td class="left">replicate-ignore-db</td>
<td class="left">slave忽略某些数据库的操作</td>
</tr>

<tr>
<td class="left">binlog-ignore-db</td>
<td class="left">master将某些数据库操作不写入binlog</td>
</tr>

<tr>
<td class="left">binlog-format</td>
<td class="left">binlog日志格式</td>
</tr>
</tbody>
</table>

<p>
binlog-format有三种选择
</p>
<ul class="org-ul">
<li>STATEMENT 基于语句，比较简短但是控制粒度不高
</li>
<li>ROW 基于数据行，比较冗余但是控制粒度好
</li>
<li>MIXED 混合。优先选择基于数据行，确有必要时候使用基于语句
</li>
</ul>

<p>
基本命令：
</p>
<ul class="org-ul">
<li>show binary logs; # 所有binlog
</li>
<li>show master logs; # 所有binlog
</li>
<li>show binlog events; # 察看binlog内容
</li>
<li>show master status; # 当前master进度
</li>
<li>reset master; # 清除所有binlog
</li>
<li>reset slave; # 清除所有relaylog
</li>
<li>start/stop slave # 启动停止复制
<ul class="org-ul">
<li>IO_THREAD 只启动停止IO线程
</li>
<li>SQL_THREAD 只启动停止SQL线程
</li>
</ul>
</li>
<li>purge master/binary logs to 'log-bin.000012'; # 将log-bin.000012之前的binlog都删除
</li>
<li>change master to master_host='', master_user='', master_password='', master_log_file='', master_log_pos='' # 初始化复制坐标
<ul class="org-ul">
<li>初始复制状态会记录在master.info文件，并且随着镜像工作进展而刷新这个文件
</li>
</ul>
</li>
</ul>

<p>
半同步(semi-sync)
</p>
<ul class="org-ul">
<li><a href="http://www.db110.com/?p=3364">http://www.db110.com/?p=3364</a>
</li>
<li><a href="http://code.google.com/p/google-mysql-tools/wiki/SemiSyncReplication">http://code.google.com/p/google-mysql-tools/wiki/SemiSyncReplication</a>
</li>
<li><a href="http://code.google.com/p/google-mysql-tools/wiki/SemiSyncReplicationDesign">http://code.google.com/p/google-mysql-tools/wiki/SemiSyncReplicationDesign</a>
</li>
<li><a href="http://dev.mysql.com/doc/refman/5.5/en/replication-semisync.html">http://dev.mysql.com/doc/refman/5.5/en/replication-semisync.html</a>
</li>
</ul>
<p>
很早之前做了一个mysql集群主从切换模块，里面就涉及到了半同步。按照半同步的定义（全同步的语义应该就是等待所有的slave都同步完成，强一致性），半同步还是会存在丢数据的可能，半同步的语义仅仅是认为一个slave同步到数据之后的话同步就完成。但是如果master挂掉同时slave也挂掉（或者是没有等其他slave补齐数据的话），那么就会存在数据丢失的可能（仅仅是提供最终一致性可能）。Semisynchronous replication can be used as an alternative to asynchronous replication:
</p>
<ul class="org-ul">
<li>A slave indicates whether it is semisynchronous-capable when it connects to the master.（slave必须声明自己是semi-sync的）
</li>
<li>If semisynchronous replication is enabled on the master side and there is at least one semisynchronous slave, a thread that performs a transaction commit on the master blocks after the commit is done and waits until at least one semisynchronous slave acknowledges that it has received all events for the transaction, or until a timeout occurs.（master也必须声明自己是semi-sync的，并且至少一个semi-sync slave连接上来，才会开启semi-sync模式。事务必须至少有一个semi-sync slave确认之后才会成功返回）
</li>
<li>The slave acknowledges receipt of a transaction's events only after the events have been written to its relay log and flushed to disk.（slave的确认是relay log完全刷到磁盘上）
</li>
<li>If a timeout occurs without any slave having acknowledged the transaction, the master reverts to asynchronous replication. When at least one semisynchronous slave catches up, the master returns to semisynchronous replication.（如果超时之前没有确认事务的话，那么master会转到async模式，直到有一个semi-sync slave追上为止）
</li>
<li>Semisynchronous replication must be enabled on both the master and slave sides. If semisynchronous replication is disabled on the master, or enabled on the master but on no slaves, the master uses asynchronous replication.（slave和master两端都必须打开semi-sync）
</li>
</ul>

<p>
GTID(global trx id)(since MySQL 5.6)
</p>
<ul class="org-ul">
<li><a href="https://dev.mysql.com/doc/refman/5.6/en/replication-gtids.html">https://dev.mysql.com/doc/refman/5.6/en/replication-gtids.html</a>
</li>
<li><a href="http://www.mysqlperformanceblog.com/2013/02/08/how-to-createrestore-a-slave-using-gtid-replication-in-mysql-5-6/">http://www.mysqlperformanceblog.com/2013/02/08/how-to-createrestore-a-slave-using-gtid-replication-in-mysql-5-6/</a>
</li>
</ul>
<p>
需要使用下面参数
</p>
<ul class="org-ul">
<li>gtid_mode=ON
</li>
<li>log-bin
</li>
<li>log-slave-updates
</li>
<li>enforce-gtid-consistency=true
</li>
<li>server_id
</li>
<li>#note: much eaiser to handle master-slave replication and failover situation
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> 配置文件</h2>
<div class="outline-text-2" id="text-13">
<ul class="org-ul">
<li>~/.my.cnf overrides /etc/my.cnf
</li>
<li>[client] MySQL客户端程序选项组标记
</li>
<li>[server] MySQL服务端程序选项组标记
</li>
<li>[mysqld] MySQL服务端程序选项组标记
</li>
<li>[mysqld-X.Y] MySQL服务端程序选项组标记，但是只有X.Y这个版本才会读取
</li>
<li>[mysqld&lt;nnnn&gt;] MySQL服务实例&lt;nnnn&gt;选项组标记，启动多实例时候有用
</li>
<li>[mysqld_safe] mysqld_safe程序选项组标记
</li>
<li>[mysqld_multi] mysqld_multi程序选项组标记
</li>
<li>[mysql_install_db] mysql_install_db程序选项组标记
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> 系统变量</h2>
<div class="outline-text-2" id="text-14">
<ul class="org-ul">
<li><a href="http://www.mysqlperformanceblog.com/2014/01/28/10-mysql-settings-to-tune-after-installation/">http://www.mysqlperformanceblog.com/2014/01/28/10-mysql-settings-to-tune-after-installation/</a>
</li>
</ul>

<p>
系统变量按照其作用范围的大小分为两个级别
</p>
<ul class="org-ul">
<li>全局级 # 全面影响整个服务器的操作，比如key_buffer_size控制MyISAM的索引数据缓冲区大小
</li>
<li>会话级 # 只印象服务器如何对待一个给定的客户链接，比如autocommit控制是否自动提交事务
</li>
</ul>
<p>
可以通过下面两个命令来察看
</p>
<ul class="org-ul">
<li>SHOW VARIABLES # 优先会话级别
<ul class="org-ul">
<li>SHOW GLOBAl VARIABLES
</li>
<li>SHOW SESSION/LOCAL VARIABLES
</li>
</ul>
</li>
<li>mysqladmin variables # 全局级别
</li>
</ul>
<p>
在SQL语句变量先使用会话级别，然后再使用全局级别，也可以显式指定
</p>
<ul class="org-ul">
<li>@@SESSION.var_name
</li>
<li>@@LOCAL.var_name
</li>
<li>@@GLOBAL.var_name
</li>
</ul>

<p>
MySQL服务器提供的状态变量使我们可以及时掌握它的实际运行状况。状态变量也分为全局和会话级别，可以通过下面命令察看
</p>
<ul class="org-ul">
<li>SHOW STATUS
</li>
<li>SHOW GLOBAL STATUS
</li>
<li>SHOW LOCAL/SESSION STATUS
</li>
</ul>
</div>

<div id="outline-container-sec-14-1" class="outline-3">
<h3 id="sec-14-1"><span class="section-number-3">14.1</span> 日志相关</h3>
<div class="outline-text-3" id="text-14-1">
<p>
刷新日志
</p>
<ul class="org-ul">
<li>FLUSH LOG &amp; mysqladmin flush-logs
</li>
<li>出错日志会关闭并且重命名为-old后缀文件，然后重新打开新文件写
</li>
<li>二进制和中继日志会关闭当前文件，然后打开下一个顺序编号的新文件
</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">选项</th>
<th scope="col" class="left">内容</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">log-error[=filename]</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">log[=filename]</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">log-slow-queries=[filename]</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">log-output[=destionation]</td>
<td class="left">常规/慢查询日志存放地点，FILE（文件，默认）/TABLE（数据表）/NONE</td>
</tr>

<tr>
<td class="left">log-bin[=flename]</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">log-bin-index=filename</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">log-relay[=filename]</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">replay-log-index=filename</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">log-short-format</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">log-queries-not-using-indexes</td>
<td class="left">执行时没有使用索引的查询记录到慢查询日志</td>
</tr>

<tr>
<td class="left">log-slow-admin-statements</td>
<td class="left">执行较慢的系统管理语句记录到慢查询日志</td>
</tr>
</tbody>
</table>


<p>
binlog &amp; relaylog
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">选项</th>
<th scope="col" class="left">内容</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">sync_binlog=n</td>
<td class="left">每进行n次事务提交之后使用fsync等磁盘同步指令将binlog_cache中数据强制写入磁盘</td>
</tr>
</tbody>
</table>
</div>
</div>
