src/mysql.org
*** 系统相关
| 选项                         | 内容                                 |
|------------------------------+--------------------------------------|
| basedir                      | MySQL安装根目录                      |
| datadir                      | MySQL数据目录                        |
| port                         |                                      |
| socket                       |                                      |
| pid-file                     |                                      |
| max_allowed_packet            | 通信使用的缓冲区最大长度             |
| max_connections              | 同时处于打开状态的客户连接的最大个数 |
| table_cache/table_open_cache | 数据表文件句柄最大数                 |

*** 存储引擎
http://dev.mysql.com/doc/refman/5.6/en/innodb-parameters.html

| 选项                            | 内容                                        |
|---------------------------------+---------------------------------------------|
| default-storage-engine[=innodb] | 默认存储引擎                                |
| innodb-file-per-table           | 为每个数据表创建一个表空间                  |
| innodb_data_home_dir            | 数据目录（默认是MySQL数据目录）             |
| innodb_data_file_path           | 数据文件列表                                |
| innodb_autoextend_increment     | 扩展表空间时递增量（8MB）                   |
| innodb_buffer_pool_size         | 数据和索引缓冲区大小                        |
| innodb_log_buffer_size          | 事务日志缓冲区                              |
| innodb_log_group_home_dir       | 事务日志文件(ib_)存放目录（默认是数据目录） |
| innodb_log_file_size            | 单个事务日志文件长度                        |
| innodb_log_files_in_group       | 事务日志文件数量（？？？）                  |
| innodb_flush_log_at_trx_commit  | 控制事务提交刷日志方式                      |
| innodb_flush_log_at_timeout     | 控制刷日志时间间隔                          |

innodb_data_file_path的格式这里需要详细解释，每个文件之间通过;分隔，每个文件规格说明如下
- path:size # 文件初始大小size字节，并且不可扩展
- path:size:autoextend # 文件初始大小size字节，但是允许自动扩展 #note: 通常写在最后一项
比如innodata1:50M;innodata2:100M;innodata3:200M:autoextend

InnoDB可以使用未经过格式化的硬盘分区，有几个理由值得考虑这么做：
- 不受文件系统控制
- 保证整个存储空间连续性，减少存储空间碎片化
- 减少文件系统管理层开销
但是考虑不要使用硬盘分区来构成表空间时，有个很重要的因素： *有许多系统备份软件只针对文件系统，不能对硬盘分区进行备份* 。这意味着使用硬盘分区来构成表空间将会给系统备份工作增加困难。

innodb_flush_log_at_trx_commit 可以用来控制提交事务时写入磁盘的方式
- 0. 隔段时间log_buffer会写入log_file并且刷入磁盘
- 1（默认值). 每次提交事务都会将log_buffer写入log_file并且刷入磁盘
- 2. 每次提交事务都会将log_buffer写入log_file, 但是隔段时间再刷入磁盘
间隔时间由 innodb_flush_log_at_timeout 控制，默认是1s

** 编程接口
*** 超时重连
JDBC连接数据库出现如下问题
#+BEGIN_QUOTE
Caused by: com.mysql.jdbc.exceptions.jdbc4.CommunicationsException: The last packet successfully received from the server was 99,184,284 milliseconds ago.  The last packet sent successfully to the server was 99,184,284 milliseconds
 ago. is longer than the server configured value of 'wait_timeout'. You should consider either expiring and/or testing connection validity before use in your application, increasing the server configured values for client timeouts,
 or using the Connector/J connection property 'autoReconnect=true' to avoid this problem.
#+END_QUOTE

出现这个问题原因是因为，mysql服务对于长时间不活跃的连接会直接关闭掉，这样client的连接下次操作的时候会出现连接错误。按照上面给出的提示，一个方法是修改wait_timeout，另外一个方法是在JDBC uri里面指定autoReconnect=true这个选项支持自动重连。但是autoReconnect只是对MySQL4以及更老的版本适用，对于MySQL5不适用。接下来看看timeout这个参数。MySQL5手册中对两个变量有如下的说明：
- interactive_timeout：服务器关闭交互式连接前等待活动的秒数。交互式客户端定义为在mysql_real_connect()中使用CLIENT_INTERACTIVE选项的客户端。又见wait_timeout
- wait_timeout:服务器关闭非交互连接之前等待活动的秒数。在线程启动时，根据全局wait_timeout值或全局interactive_timeout值初始化会话wait_timeout值，取决于客户端类型(由mysql_real_connect()的连接选项CLIENT_INTERACTIVE定义)，又见interactive_timeout
可见wait_timeout只要是用于非交互下面的connection超时时间。可以通过增大这个值然后重启服务来缓解这个问题。

但是很明显这个问题治标不治本，最好设想出一个办法可以自动重连。实现自动重连大致无非三种实现：
- 每次操作之前检查连接是否OK。这样比较简单，但是有overhead.
- 存在单独线程检查连接是否OK。这样overhead比较小，但是实现有点麻烦。
- 每次直接执行SQL。如果出现连接错误的话，那么重新连接再次执行SQL。这个方法overhead比较小，同时相对来说也比较简单。

