html/mysql.html

<div id="outline-container-sec-14-2" class="outline-3">
<h3 id="sec-14-2"><span class="section-number-3">14.2</span> 系统相关</h3>
<div class="outline-text-3" id="text-14-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">选项</th>
<th scope="col" class="left">内容</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">basedir</td>
<td class="left">MySQL安装根目录</td>
</tr>

<tr>
<td class="left">datadir</td>
<td class="left">MySQL数据目录</td>
</tr>

<tr>
<td class="left">port</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">socket</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">pid-file</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">max_allowed_packet</td>
<td class="left">通信使用的缓冲区最大长度</td>
</tr>

<tr>
<td class="left">max_connections</td>
<td class="left">同时处于打开状态的客户连接的最大个数</td>
</tr>

<tr>
<td class="left">table_cache/table_open_cache</td>
<td class="left">数据表文件句柄最大数</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-14-3" class="outline-3">
<h3 id="sec-14-3"><span class="section-number-3">14.3</span> 存储引擎</h3>
<div class="outline-text-3" id="text-14-3">
<p>
<a href="http://dev.mysql.com/doc/refman/5.6/en/innodb-parameters.html">http://dev.mysql.com/doc/refman/5.6/en/innodb-parameters.html</a>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">选项</th>
<th scope="col" class="left">内容</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">default-storage-engine[=innodb]</td>
<td class="left">默认存储引擎</td>
</tr>

<tr>
<td class="left">innodb-file-per-table</td>
<td class="left">为每个数据表创建一个表空间</td>
</tr>

<tr>
<td class="left">innodb_data_home_dir</td>
<td class="left">数据目录（默认是MySQL数据目录）</td>
</tr>

<tr>
<td class="left">innodb_data_file_path</td>
<td class="left">数据文件列表</td>
</tr>

<tr>
<td class="left">innodb_autoextend_increment</td>
<td class="left">扩展表空间时递增量（8MB）</td>
</tr>

<tr>
<td class="left">innodb_buffer_pool_size</td>
<td class="left">数据和索引缓冲区大小</td>
</tr>

<tr>
<td class="left">innodb_log_buffer_size</td>
<td class="left">事务日志缓冲区</td>
</tr>

<tr>
<td class="left">innodb_log_group_home_dir</td>
<td class="left">事务日志文件(ib_)存放目录（默认是数据目录）</td>
</tr>

<tr>
<td class="left">innodb_log_file_size</td>
<td class="left">单个事务日志文件长度</td>
</tr>

<tr>
<td class="left">innodb_log_files_in_group</td>
<td class="left">事务日志文件数量（？？？）</td>
</tr>

<tr>
<td class="left">innodb_flush_log_at_trx_commit</td>
<td class="left">控制事务提交刷日志方式</td>
</tr>

<tr>
<td class="left">innodb_flush_log_at_timeout</td>
<td class="left">控制刷日志时间间隔</td>
</tr>
</tbody>
</table>

<p>
innodb_data_file_path的格式这里需要详细解释，每个文件之间通过;分隔，每个文件规格说明如下
</p>
<ul class="org-ul">
<li>path:size # 文件初始大小size字节，并且不可扩展
</li>
<li>path:size:autoextend # 文件初始大小size字节，但是允许自动扩展 #note: 通常写在最后一项
</li>
</ul>
<p>
比如innodata1:50M;innodata2:100M;innodata3:200M:autoextend
</p>

<p>
InnoDB可以使用未经过格式化的硬盘分区，有几个理由值得考虑这么做：
</p>
<ul class="org-ul">
<li>不受文件系统控制
</li>
<li>保证整个存储空间连续性，减少存储空间碎片化
</li>
<li>减少文件系统管理层开销
</li>
</ul>
<p>
但是考虑不要使用硬盘分区来构成表空间时，有个很重要的因素： <b>有许多系统备份软件只针对文件系统，不能对硬盘分区进行备份</b> 。这意味着使用硬盘分区来构成表空间将会给系统备份工作增加困难。
</p>

<p>
innodb_flush_log_at_trx_commit 可以用来控制提交事务时写入磁盘的方式
</p>
<ul class="org-ul">
<li>0. 隔段时间log_buffer会写入log_file并且刷入磁盘
</li>
<li>1（默认值). 每次提交事务都会将log_buffer写入log_file并且刷入磁盘
</li>
<li>2. 每次提交事务都会将log_buffer写入log_file, 但是隔段时间再刷入磁盘
</li>
</ul>
<p>
间隔时间由 innodb_flush_log_at_timeout 控制，默认是1s
</p>
</div>
</div>
</div>

<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> 编程接口</h2>
<div class="outline-text-2" id="text-15">
</div><div id="outline-container-sec-15-1" class="outline-3">
<h3 id="sec-15-1"><span class="section-number-3">15.1</span> 超时重连</h3>
<div class="outline-text-3" id="text-15-1">
<p>
JDBC连接数据库出现如下问题
</p>
<blockquote>
<p>
Caused by: com.mysql.jdbc.exceptions.jdbc4.CommunicationsException: The last packet successfully received from the server was 99,184,284 milliseconds ago.  The last packet sent successfully to the server was 99,184,284 milliseconds
 ago. is longer than the server configured value of 'wait_timeout'. You should consider either expiring and/or testing connection validity before use in your application, increasing the server configured values for client timeouts,
 or using the Connector/J connection property 'autoReconnect=true' to avoid this problem.
</p>
</blockquote>

<p>
出现这个问题原因是因为，mysql服务对于长时间不活跃的连接会直接关闭掉，这样client的连接下次操作的时候会出现连接错误。按照上面给出的提示，一个方法是修改wait_timeout，另外一个方法是在JDBC uri里面指定autoReconnect=true这个选项支持自动重连。但是autoReconnect只是对MySQL4以及更老的版本适用，对于MySQL5不适用。接下来看看timeout这个参数。MySQL5手册中对两个变量有如下的说明：
</p>
<ul class="org-ul">
<li>interactive_timeout：服务器关闭交互式连接前等待活动的秒数。交互式客户端定义为在mysql_real_connect()中使用CLIENT_INTERACTIVE选项的客户端。又见wait_timeout
</li>
<li>wait_timeout:服务器关闭非交互连接之前等待活动的秒数。在线程启动时，根据全局wait_timeout值或全局interactive_timeout值初始化会话wait_timeout值，取决于客户端类型(由mysql_real_connect()的连接选项CLIENT_INTERACTIVE定义)，又见interactive_timeout
</li>
</ul>
<p>
可见wait_timeout只要是用于非交互下面的connection超时时间。可以通过增大这个值然后重启服务来缓解这个问题。
</p>

<p>
但是很明显这个问题治标不治本，最好设想出一个办法可以自动重连。实现自动重连大致无非三种实现：
</p>
<ul class="org-ul">
<li>每次操作之前检查连接是否OK。这样比较简单，但是有overhead.
</li>
<li>存在单独线程检查连接是否OK。这样overhead比较小，但是实现有点麻烦。
</li>
<li>每次直接执行SQL。如果出现连接错误的话，那么重新连接再次执行SQL。这个方法overhead比较小，同时相对来说也比较简单。
</li>
</ul>
</div>
</div>
