src/mysql.org
*** 连接数量
- http://www.mysqlperformanceblog.com/2014/01/23/percona-server-improve-scalability-percona-thread-pool/

mysql最大连接数目可以通过参数max_connections进行配置，默认的连接数目是比较低的，对于需要处理大量请求的web服务来说需要增大。 *修改之后需要重启*

#+BEGIN_EXAMPLE
mysql> show variables like 'max_connections';
+-----------------+-------+
| Variable_name   | Value |
+-----------------+-------+
| max_connections | 8192  |
+-----------------+-------+
1 row in set (0.00 sec)

mysql> show status like '%connect%';
+--------------------------+-------+
| Variable_name            | Value |
+--------------------------+-------+
| Aborted_connects         | 1     |
| Connections              | 6152  |
| Max_used_connections     | 4098  |
| Ssl_client_connects      | 0     |
| Ssl_connect_renegotiates | 0     |
| Ssl_finished_connects    | 0     |
| Threads_connected        | 2050  |
+--------------------------+-------+

7 rows in set (0.00 sec)
#+END_EXAMPLE

对于status状态来说有下面几个和connection相关的数值
- Aborted_connects 尝试已经失败的MySQL服务器的连接的次数。
- Connections 试图连接MySQL服务器的次数。
- Max_used_connections 同时使用的连接的最大数目。
- Threads_connected 当前打开的连接的数量。

修改最大连接数目之后，连接端可能会出现如下错误
#+BEGIN_EXAMPLE
2013-04-16 19:55:29,772 FATAL com.umeng.dp.umid.UmidHandler: Connection to database failed.
java.sql.SQLException: null,  message from server: "Can't create a new thread (errno 11); if you are not out of available memory, you can consult the manual for a possible OS-dependent bug"
    at com.mysql.jdbc.SQLError.createSQLException(SQLError.java:1074)
    at com.mysql.jdbc.SQLError.createSQLException(SQLError.java:988)
    at com.mysql.jdbc.SQLError.createSQLException(SQLError.java:974)
    at com.mysql.jdbc.MysqlIO.doHandshake(MysqlIO.java:1104)
    at com.mysql.jdbc.ConnectionImpl.coreConnect(ConnectionImpl.java:2412)
    at com.mysql.jdbc.ConnectionImpl.connectOneTryOnly(ConnectionImpl.java:2445)
    at com.mysql.jdbc.ConnectionImpl.createNewIO(ConnectionImpl.java:2230)
    at com.mysql.jdbc.ConnectionImpl.<init>(ConnectionImpl.java:813)
    at com.mysql.jdbc.JDBC4Connection.<init>(JDBC4Connection.java:47)
    at sun.reflect.GeneratedConstructorAccessor2.newInstance(Unknown Source)
    at sun.reflect.DelegatingConstructorAccessorImpl.newInstance(DelegatingConstructorAccessorImpl.java:27)
    at java.lang.reflect.Constructor.newInstance(Constructor.java:513)
    at com.mysql.jdbc.Util.handleNewInstance(Util.java:411)
    at com.mysql.jdbc.ConnectionImpl.getInstance(ConnectionImpl.java:399)
    at com.mysql.jdbc.NonRegisteringDriver.connect(NonRegisteringDriver.java:334)
    at java.sql.DriverManager.getConnection(DriverManager.java:582)
    at java.sql.DriverManager.getConnection(DriverManager.java:185)
    at com.umeng.dp.umid.MysqlConnectionPool.getConnection(MysqlConnectionPool.java:50)
    at com.umeng.dp.umid.DcdiAuthority.getDCDI(DcdiAuthority.java:156)
    at com.umeng.dp.umid.UmidHandler.run(UmidHandler.java:115)
    at java.util.concurrent.Executors$RunnableAdapter.call(Executors.java:439)
    at java.util.concurrent.FutureTask$Sync.innerRun(FutureTask.java:303)
    at java.util.concurrent.FutureTask.run(FutureTask.java:138)
    at java.util.concurrent.ThreadPoolExecutor$Worker.runTask(ThreadPoolExecutor.java:886)
    at java.util.concurrent.ThreadPoolExecutor$Worker.run(ThreadPoolExecutor.java:908)
    at java.lang.Thread.run(Thread.java:662)
#+END_EXAMPLE

问题还是出在资源限制上面，可以通过修改开辟最大的进程数目来解决。可以参考链接 http://www.mysqlperformanceblog.com/2013/02/04/cant_create_thread_errno_11/

** 实用程序
MySQL（5.6） Installation Layout for Generic Unix/Linux Binary Package

| Directory     | Contents of Directory                                                                                            |
|---------------+------------------------------------------------------------------------------------------------------------------|
| bin           | Client programs and the mysqld server                                                                            |
| data          | Log files, databases                                                                                             |
| docs          | Manual in Info format                                                                                            |
| man           | Unix manual pages                                                                                                |
| include       | Include (header) files                                                                                           |
| lib           | Libraries                                                                                                        |
| scripts       | mysql_install_db                                                                                                 |
| share         | Miscellaneous support files, including error messages, sample configuration files, SQL for database installation |
| sql-bench     | Benchmarks                                                                                                       |
| mysql-test    | note: test suite                                                                                          |
| support-files |                                                                                                                  |

- mysql_install_db # 初始化基本表
  - --user 用户
  - --datadir 数据目录
  - --basedir 安装目录
  - --defaults-file 配置文件
  - 用户问题 http://anothermysqldba.blogspot.com/2013/05/warning-because-user-was-set-to-mysql.html
  - 权限问题 http://www.huoxingfan.com/834.html
- mysqld # 服务端
- mysql # 客户端
- mysqld_safe # 启动脚本
  - --skip-grant-tables # 忽略权限表 #note: 可以用来重置密码
  - --skip-networking # 不启动网络接口
  - --defaults-file 配置文件
- mysql.server # 启停脚本
  - 对mysqld_safe的包装，不接受任何参数
  - 提供start/stop/restart方法
- mysqld_multi # 启动多个MySQL实例
  - --defaults-file # Read only this configuration file, do not read the standard system-wide and user-specific files
  - --defaults-extra-file # Read this configuration file in addition to the standard system-wide and user-specific files
- mysqlbinlog # 察看二进制日志文件
- mysqladmin # 系统管理程序，包括关停服务器，检查配置，监控工作状态等
- mysqlcheck # 数据库检查，分析，优化以及对受损数据表进行修复
- mysqldump # 制作数据库文本备份
  - SOURCE file # 导入SQL文件

** 其他信息
