html/mysql.html

<div id="outline-container-sec-15-2" class="outline-3">
<h3 id="sec-15-2"><span class="section-number-3">15.2</span> 连接数量</h3>
<div class="outline-text-3" id="text-15-2">
<ul class="org-ul">
<li><a href="http://www.mysqlperformanceblog.com/2014/01/23/percona-server-improve-scalability-percona-thread-pool/">http://www.mysqlperformanceblog.com/2014/01/23/percona-server-improve-scalability-percona-thread-pool/</a>
</li>
</ul>

<p>
mysql最大连接数目可以通过参数max_connections进行配置，默认的连接数目是比较低的，对于需要处理大量请求的web服务来说需要增大。 <b>修改之后需要重启</b>
</p>

<pre class="example">
mysql&gt; show variables like 'max_connections';
+-----------------+-------+
| Variable_name   | Value |
+-----------------+-------+
| max_connections | 8192  |
+-----------------+-------+
1 row in set (0.00 sec)

mysql&gt; show status like '%connect%';
+--------------------------+-------+
| Variable_name            | Value |
+--------------------------+-------+
| Aborted_connects         | 1     |
| Connections              | 6152  |
| Max_used_connections     | 4098  |
| Ssl_client_connects      | 0     |
| Ssl_connect_renegotiates | 0     |
| Ssl_finished_connects    | 0     |
| Threads_connected        | 2050  |
+--------------------------+-------+

7 rows in set (0.00 sec)
</pre>

<p>
对于status状态来说有下面几个和connection相关的数值
</p>
<ul class="org-ul">
<li>Aborted_connects 尝试已经失败的MySQL服务器的连接的次数。
</li>
<li>Connections 试图连接MySQL服务器的次数。
</li>
<li>Max_used_connections 同时使用的连接的最大数目。
</li>
<li>Threads_connected 当前打开的连接的数量。
</li>
</ul>

<p>
修改最大连接数目之后，连接端可能会出现如下错误
</p>
<pre class="example">
2013-04-16 19:55:29,772 FATAL com.umeng.dp.umid.UmidHandler: Connection to database failed.
java.sql.SQLException: null,  message from server: "Can't create a new thread (errno 11); if you are not out of available memory, you can consult the manual for a possible OS-dependent bug"
    at com.mysql.jdbc.SQLError.createSQLException(SQLError.java:1074)
    at com.mysql.jdbc.SQLError.createSQLException(SQLError.java:988)
    at com.mysql.jdbc.SQLError.createSQLException(SQLError.java:974)
    at com.mysql.jdbc.MysqlIO.doHandshake(MysqlIO.java:1104)
    at com.mysql.jdbc.ConnectionImpl.coreConnect(ConnectionImpl.java:2412)
    at com.mysql.jdbc.ConnectionImpl.connectOneTryOnly(ConnectionImpl.java:2445)
    at com.mysql.jdbc.ConnectionImpl.createNewIO(ConnectionImpl.java:2230)
    at com.mysql.jdbc.ConnectionImpl.&lt;init&gt;(ConnectionImpl.java:813)
    at com.mysql.jdbc.JDBC4Connection.&lt;init&gt;(JDBC4Connection.java:47)
    at sun.reflect.GeneratedConstructorAccessor2.newInstance(Unknown Source)
    at sun.reflect.DelegatingConstructorAccessorImpl.newInstance(DelegatingConstructorAccessorImpl.java:27)
    at java.lang.reflect.Constructor.newInstance(Constructor.java:513)
    at com.mysql.jdbc.Util.handleNewInstance(Util.java:411)
    at com.mysql.jdbc.ConnectionImpl.getInstance(ConnectionImpl.java:399)
    at com.mysql.jdbc.NonRegisteringDriver.connect(NonRegisteringDriver.java:334)
    at java.sql.DriverManager.getConnection(DriverManager.java:582)
    at java.sql.DriverManager.getConnection(DriverManager.java:185)
    at com.umeng.dp.umid.MysqlConnectionPool.getConnection(MysqlConnectionPool.java:50)
    at com.umeng.dp.umid.DcdiAuthority.getDCDI(DcdiAuthority.java:156)
    at com.umeng.dp.umid.UmidHandler.run(UmidHandler.java:115)
    at java.util.concurrent.Executors$RunnableAdapter.call(Executors.java:439)
    at java.util.concurrent.FutureTask$Sync.innerRun(FutureTask.java:303)
    at java.util.concurrent.FutureTask.run(FutureTask.java:138)
    at java.util.concurrent.ThreadPoolExecutor$Worker.runTask(ThreadPoolExecutor.java:886)
    at java.util.concurrent.ThreadPoolExecutor$Worker.run(ThreadPoolExecutor.java:908)
    at java.lang.Thread.run(Thread.java:662)
</pre>

<p>
问题还是出在资源限制上面，可以通过修改开辟最大的进程数目来解决。可以参考链接 <a href="http://www.mysqlperformanceblog.com/2013/02/04/cant_create_thread_errno_11/">http://www.mysqlperformanceblog.com/2013/02/04/cant_create_thread_errno_11/</a>
</p>
</div>
</div>
</div>

<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16"><span class="section-number-2">16</span> 实用程序</h2>
<div class="outline-text-2" id="text-16">
<p>
MySQL（5.6） Installation Layout for Generic Unix/Linux Binary Package
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Directory</th>
<th scope="col" class="left">Contents of Directory</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">bin</td>
<td class="left">Client programs and the mysqld server</td>
</tr>

<tr>
<td class="left">data</td>
<td class="left">Log files, databases</td>
</tr>

<tr>
<td class="left">docs</td>
<td class="left">Manual in Info format</td>
</tr>

<tr>
<td class="left">man</td>
<td class="left">Unix manual pages</td>
</tr>

<tr>
<td class="left">include</td>
<td class="left">Include (header) files</td>
</tr>

<tr>
<td class="left">lib</td>
<td class="left">Libraries</td>
</tr>

<tr>
<td class="left">scripts</td>
<td class="left">mysql_install_db</td>
</tr>

<tr>
<td class="left">share</td>
<td class="left">Miscellaneous support files, including error messages, sample configuration files, SQL for database installation</td>
</tr>

<tr>
<td class="left">sql-bench</td>
<td class="left">Benchmarks</td>
</tr>

<tr>
<td class="left">mysql-test</td>
<td class="left">note: test suite</td>
</tr>

<tr>
<td class="left">support-files</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>mysql_install_db # 初始化基本表
<ul class="org-ul">
<li>&#x2013;user 用户
</li>
<li>&#x2013;datadir 数据目录
</li>
<li>&#x2013;basedir 安装目录
</li>
<li>&#x2013;defaults-file 配置文件
</li>
<li>用户问题 <a href="http://anothermysqldba.blogspot.com/2013/05/warning-because-user-was-set-to-mysql.html">http://anothermysqldba.blogspot.com/2013/05/warning-because-user-was-set-to-mysql.html</a>
</li>
<li>权限问题 <a href="http://www.huoxingfan.com/834.html">http://www.huoxingfan.com/834.html</a>
</li>
</ul>
</li>
<li>mysqld # 服务端
</li>
<li>mysql # 客户端
</li>
<li>mysqld_safe # 启动脚本
<ul class="org-ul">
<li>&#x2013;skip-grant-tables # 忽略权限表 #note: 可以用来重置密码
</li>
<li>&#x2013;skip-networking # 不启动网络接口
</li>
<li>&#x2013;defaults-file 配置文件
</li>
</ul>
</li>
<li>mysql.server # 启停脚本
<ul class="org-ul">
<li>对mysqld_safe的包装，不接受任何参数
</li>
<li>提供start/stop/restart方法
</li>
</ul>
</li>
<li>mysqld_multi # 启动多个MySQL实例
<ul class="org-ul">
<li>&#x2013;defaults-file # Read only this configuration file, do not read the standard system-wide and user-specific files
</li>
<li>&#x2013;defaults-extra-file # Read this configuration file in addition to the standard system-wide and user-specific files
</li>
</ul>
</li>
<li>mysqlbinlog # 察看二进制日志文件
</li>
<li>mysqladmin # 系统管理程序，包括关停服务器，检查配置，监控工作状态等
</li>
<li>mysqlcheck # 数据库检查，分析，优化以及对受损数据表进行修复
</li>
<li>mysqldump # 制作数据库文本备份
<ul class="org-ul">
<li>SOURCE file # 导入SQL文件
</li>
</ul>
</li>
</ul>
</div>
</div>
