src/mysql.org
*** 安装环境
Not all platforms are equally well-suited for running MySQL. How
well a certain platform is suited for a high-load mission-critical
MySQL server is determined by the following factors:

  * General stability of the thread library. A platform may have
    an excellent reputation otherwise, but MySQL is only as stable
    as the thread library it calls, even if everything else is
    perfect.

  * The capability of the kernel and the thread library to take
    advantage of symmetric multi-processor (SMP) systems. In other
    words, when a process creates a thread, it should be possible
    for that thread to run on a CPU different from the original
    process.

  * The capability of the kernel and the thread library to run
    many threads that acquire and release a mutex over a short
    critical region frequently without excessive context switches.
    If the implementation of pthread_mutex_lock() is too anxious
    to yield CPU time, this hurts MySQL tremendously. If this
    issue is not taken care of, adding extra CPUs actually makes
    MySQL slower.

  * General file system stability and performance.

  * Table size. If your tables are large, performance is affected
    by the ability of the file system to deal with large files and
    dealing with them efficiently.

  * Our level of expertise here at Oracle Corporation with the
    platform. If we know a platform well, we enable
    platform-specific optimizations and fixes at compile time. We
    can also provide advice on configuring your system optimally
    for MySQL.

  * The amount of testing we have done internally for similar
    configurations.

  * The number of users that have run MySQL successfully on the
    platform in similar configurations. If this number is high,
    the likelihood of encountering platform-specific surprises is
    much smaller.

*** 版本选择
The naming scheme in MySQL 5.6 uses release names that consist of
three numbers and a suffix; for example, mysql-5.6.1-m1. The
numbers within the release name are interpreted as follows:

  * The first number (5) is the major version and describes the
    file format. All MySQL 5 releases have the same file format.

  * The second number (6) is the release level. Taken together,
    the major version and release level constitute the release
    series number.

  * The third number (1) is the version number within the release
    series. This is incremented for each new release. Usually you
    want the latest version for the series you have chosen.

For each minor update, the last number in the version string is
incremented. When there are major new features or minor
incompatibilities with previous versions, the second number in the
version string is incremented. When the file format changes, the
first number is increased.

Release names also include a suffix to indicates the stability
level of the release. Releases within a series progress through a
set of suffixes to indicate how the stability level improves. The
possible suffixes are:

  * mN (for example, m1, m2, m3, ...) indicate a milestone number.
    MySQL development uses a milestone model, in which each
    milestone proceeds through a small number of versions with a
    tight focus on a small subset of thoroughly tested features.
    Following the releases for one milestone, development proceeds
    with another small number of releases that focuses on the next
    small set of features, also thoroughly tested. Features within
    milestone releases may be considered to be of pre-production
    quality.

  * rc indicates a Release Candidate. Release candidates are
    believed to be stable, having passed all of MySQL's internal
    testing, and with all known fatal runtime bugs fixed. However,
    the release has not been in widespread use long enough to know
    for sure that all bugs have been identified. Only minor fixes
    are added.

  * If there is no suffix, it indicates that the release is a
    General Availability (GA) or Production release. GA releases
    are stable, having successfully passed through all earlier
    release stages and are believed to be reliable, free of
    serious bugs, and suitable for use in production systems. Only
    critical bugfixes are applied to the release.

*** 测试套件
All releases of MySQL are run through our standard tests and
benchmarks to ensure that they are relatively safe to use. Because
the standard tests are extended over time to check for all
previously found bugs, the test suite keeps getting better.

All releases have been tested at least with these tools:

  * An internal test suite.  The mysql-test directory contains an
    extensive set of test cases. We run these tests for every
    server binary. See Section 23.1.2, "The MySQL Test Suite," for
    more information about this test suite.

  * The MySQL benchmark suite.  This suite runs a range of common
    queries. It is also a test to determine whether the latest
    batch of optimizations actually made the code faster. See
    Section 8.12.2, "The MySQL Benchmark Suite."

We also perform additional integration and nonfunctional testing
of the latest MySQL version in our internal production
environment. Integration testing is done with different
connectors, storage engines, replication modes, backup,
partitioning, stored programs, and so forth in various
combinations. Additional nonfunctional testing is done in areas of
performance, concurrency, stress, high volume, upgrade and
downgrade.

*** MySQL技术内幕
MySQL基础知识
- MySQL和SQL入门
- 使用SQL管理数据
- 数据类型
- 存储程序
- 查询优化
MySQL的编程接口
- MySQL程序设计
- 用C语言编写MySQL程序
- 用Perl DBI编写MySQL程序
- 用PHP编写MySQL程序
MySQL的系统管理
- MySQL系统管理简介
- MySQL的数据目录
- MySQL数据库的日常管理
- 访问控件和安全
- MySQL数据库的维护，备份和复制
